src/SSL.Chat2Desk/src/InformationRegisters/C2D_Клиенты/C2D_Клиенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>C2D_Клиенты</name>
  <resources>
    <name>Клиент</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>phone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>avatar</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>assigned_name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>client_phone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПолноеИмяТипаДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/SSL.Chat2Desk/src/InformationRegisters/C2D_ТипыКлиентов/C2D_ТипыКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>C2D_ТипыКлиентов</name>
  <comment>Регистр будет хранить данные о выбранных типах которые могут быть ассоциированы с клиентами</comment>
  <resources>
    <name>Типы</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/SSL.Chat2Desk/src/InformationRegisters/C2D_Клиенты/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СопоставленоОтбор = "Все";
	ТипыДанных = РегистрыСведений.C2D_ТипыКлиентов.ПолучитьТипыДанных();
	Если не ЗначениеЗаполнено(ТипыДанных) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнены типы привязки клиентов chat2desk к базе 1с";
		Сообщение.Сообщить();
		Отказ = истина;
		Возврат;
	КонецЕсли; 
	Элементы.КлиентТекущейСтроки.ОграничениеТипа = ТипыДанных;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
	&НаКлиенте
Процедура КлиентТекущейСтрокиПриИзменении(Элемент)
	ОбновитьКлиента(Элементы.список.текущиеДанные.id,КлиентТекущейСтроки);
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура КлиентТекущейСтрокиОчистка(Элемент, СтандартнаяОбработка)
	ОбновитьКлиента(Элементы.список.текущиеДанные.id,КлиентТекущейСтроки);
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СопоставленоОтборПриИзменении(Элемент)
		ОбработатьОтборЗаписейСопоставления();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	КлиентТекущейСтроки = НайтиКлиентаСервер(ТекущиеДанные.Клиент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОбновитьДанныеПоКлиентам(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеОтветаНаВопросОбОбновлении", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, "Обнолвение данных по клиентам может занять длительное время. Продолжить?",РежимДиалогаВопрос.ОКОтмена, 60);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоКИ(Команда)
	ЗаполнитьПоКИНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервереБезКонтекста
Процедура ОбновитьКлиента(id, Клиент)
	Запись = РегистрыСведений.C2D_Клиенты.СоздатьМенеджерЗаписи();
	Запись.id = id;
	Запись.Прочитать();
	Если не Запись.Клиент = Клиент Тогда
		Если не ЗначениеЗаполнено(Клиент) Тогда
			запись.Клиент = неопределено;
			Запись.ПолноеИмяТипаДанных = "";
		Иначе
			запись.Клиент = Клиент.УникальныйИдентификатор();
			Запись.ПолноеИмяТипаДанных =  клиент.Метаданные().полноеИмя();
		КонецЕсли;
		Запись.Представление = РегистрыСведений.C2D_Клиенты.СформироватьПредставление(Запись);
		Запись.Записать();	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросОбОбновлении(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если не РезультатВопроса = КодВозвратаДиалога.ОК Тогда
		возврат;
	КонецЕсли; 
	ДлительнаяОперация = НачатьОбновлениеКлиентовВФоне();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	Оповещение = Новый ОписаниеОповещения("ПослеЗавершенияОбновленияКлиентов",ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗавершенияОбновленияКлиентов(Результат, ДополнительныеПараметры) Экспорт
	Элементы.Список.Обновить();
КонецПроцедуры


&НаСервере
Функция НачатьОбновлениеКлиентовВФоне()
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьВФоне("РегистрыСведений.C2D_Клиенты.ОбновитьСписокКлиентовВФоне", , ПараметрыВыполнения);
КонецФункции


&НаСервере
Процедура ОбработатьОтборЗаписейСопоставления()
	
	Если СопоставленоОтбор = "Сопоставленные" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(список, "Клиент",,ВидСравненияКомпоновкиДанных.Заполнено,,Истина);
	ИначеЕсли СопоставленоОтбор = "Несопоставленные" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(список, "Клиент",,ВидСравненияКомпоновкиДанных.НеЗаполнено,,Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(список, "Клиент",,,,Ложь);
	КонецЕсли;

КонецПроцедуры


&НаСервере
Процедура ЗаполнитьПоКИНаСервере()
	РегистрыСведений.C2D_Клиенты.выполнитьПоискКлиентовПоКИВБазе();
	Элементы.Список.Обновить();	
КонецПроцедуры

&НаСервере
Функция НайтиКлиентаСервер(Guid)
	Возврат РегистрыСведений.C2D_Клиенты.НайтиСсылкуПоGUID(Guid);
КонецФункции

#КонецОбласти
